mithunbabbira/fleet_manager/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# ESP32-C6 Mini is typically used over USB-Serial/JTAG (cu.usbmodem*), not UART0 pins.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ELM_CMD_TIMEOUT_MS=12000
CONFIG_ELM_BLE_SCAN_MS=12000
# EC200U on UART1 GPIO17 TX / GPIO16 RX (Airtel APN confirmed on host probe)
CONFIG_NET_LTE_ENABLE=y
CONFIG_NET_LTE_APN="airtelgprs.com"

